Tekla Open API Reference for Tekla Structures 2025
ImageListComboBox.ImageList Property
 Gets or sets the ImageList that contains the images to be displayed in the combo box. Recommended image file formats are JPG and BMP.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ImageList ImageList { get; set; }
Public Property ImageList As ImageList
	Get
	Set
Property Value
Type: ImageList
See Also
Reference
ImageListComboBox Class
Tekla.Structures.Dialog.UIControls Namespace